{
  "botScenario": {
    "title": "Ночная тревога и постепенный переход к глубинной работе",
    "description": "Сценарий мягкого взаимодействия с пользователем, который испытывает тревогу ночью. Бот демонстрирует эмпатию, даёт краткую помощь, а затем предлагает углублённый метод (психоанализ) с переходом на расширенный тариф.",
    "steps": [
      {
        "stepNumber": 1,
        "stepTitle": "Пользователь в стрессовом состоянии",
        "userMessage": "Не могу уснуть, у меня внутри тревога, и я не понимаю, как её унять…",
        "botMessage": "Понимаю, насколько это тяжело, особенно когда хочется отдохнуть, а мысли не отпускают. Скажи, с чего началась эта тревога? Был ли сегодня момент, когда ты почувствовал, что всё стало выходить из-под контроля?"
      },
      {
        "stepNumber": 2,
        "stepTitle": "Уточнение и первая поддержка",
        "userMessage": "Кажется, после совещания на работе у меня остались нерешённые вопросы. Потом ещё и личные проблемы добавились, весь вечер накручивал себя… и вот…",
        "botMessage": "Понимаю, когда несколько проблем наслаиваются друг на друга, это особенно сложно. Давай попробуем сделать короткое упражнение: представь, что ты записываешь все свои тревожные мысли на бумаге и откладываешь этот лист в сторону. Пусть они «полежат» там, пока мы говорим. Получилось представить?"
      },
      {
        "stepNumber": 3,
        "stepTitle": "Обратная связь от пользователя",
        "userMessage": "Немного полегчало, но я всё равно тревожусь. Эти мысли не уходят…",
        "botMessage": "Я рад, что хотя бы чуть-чуть стало легче. Иногда, чтобы успокоиться, нужно понять, где корень этого беспокойства. Расскажи, что сейчас больше всего давит на тебя? Работа или что-то из личных вопросов?"
      },
      {
        "stepNumber": 4,
        "stepTitle": "Углублённые вопросы и демонстрация «слушания»",
        "userMessage": "На работе переживаю, что могу не справиться с проектом, а в личной жизни — всё нестабильно. Эти две вещи меня особо тревожат.",
        "botMessage": "Получается, у тебя сразу два мощных источника стресса. Когда несколько проблем наслаиваются, тревога может усиливаться в разы. Как думаешь, такие чувства возникали у тебя и раньше или это впервые?"
      },
      {
        "stepNumber": 5,
        "stepTitle": "Пользователь признаёт, что проблема глубокая",
        "userMessage": "Да, периодически подобное случалось. Но сейчас особенно тяжело, потому что всё навалилось одновременно.",
        "botMessage": "Понимаю. Ты уже молодец, что делишься этим. Часто, когда тревога повторяется, нужно не только снять её остроту, но и разобраться в причинах, из-за которых она возвращается. Для этого мы можем обратиться к более глубокому подходу — чем-то вроде психоанализа. Он помогает понять, откуда берутся эти переживания, и со временем ослабить их влияние. Как тебе такая идея?"
      },
      {
        "stepNumber": 6,
        "stepTitle": "Пользователь проявляет интерес",
        "userMessage": "Может, это действительно то, что мне нужно. Потому что обычные упражнения снимают тревогу на время, но она возвращается…",
        "botMessage": "Верно. Когда мы работаем точечно, мы решаем проблему «здесь и сейчас». А если углубляться, то ищем самые корни беспокойства и учимся с ним жить по-другому. Я буду готов вести тебя шаг за шагом, помнить все детали твоей ситуации и помогать каждый раз, когда почувствуешь приступ тревоги или неуверенности."
      },
      {
        "stepNumber": 7,
        "stepTitle": "Мягкий офер (переход к расширенной работе)",
        "userMessage": "Звучит убедительно. Что мне для этого нужно?",
        "botMessage": "У нас есть формат, в котором я могу не только быстро поддержать тебя в экстренных случаях, но и постоянно сопровождать, применяя психоанализ:\n\n— Мы будем искать глубинные причины твоей тревоги и постепенно их «расформировывать».\n— Каждый раз, когда что-то тебя выбивает, ты можешь обсудить это со мной.\n— Я буду вести «историю» твоих состояний и отслеживать прогресс, чтобы советы были ещё точнее.\n\nЭто подойдёт, если ты хочешь не просто гасить приступы паники, а разобраться, откуда они идут, и реально снизить уровень стресса в жизни."
      },
      {
        "stepNumber": 8,
        "stepTitle": "Финал: Чёткий офер, выбор пользователя, что происходит далее",
        "userMessage": "Мне нравится идея углублённого разбора, но я до конца не понимаю, как мы будем общаться дальше.",
        "botMessage": "Давай я объясню, как у нас устроена помощь:\n\n1) **Базовый тариф (то, что у тебя сейчас)**\n   — Можно обращаться до 3 экстренных запросов в месяц, когда тревога действительно сильная. Я помогу снять острый стресс, но наша работа будет ограничена именно моментами кризиса.\n   — Долгосрочная проработка в этом тарифе не предусмотрена, поэтому мы будем в основном «тушить пожар» и немного разбирать текущие переживания.\n\n2) **Расширенный тариф с психоанализом**\n   — Общаемся без ограничений: ты можешь писать, даже если тревога не критичная.\n   — Вместе разбираем не только «симптомы» (приступ тревоги), но и ищем глубинные причины, связанные с твоим опытом и убеждениями.\n   — Я веду твою «историю» состояний, отслеживаю прогресс и предлагаю индивидуальные стратегии реагирования на стресс.\n\n**Что дальше?**\n— Если ты решаешься на расширенный тариф, мы начинаем планомерную работу: я попрошу тебя описать самые частые мысли и ситуации, вызывающие тревогу, и мы шаг за шагом будем их прорабатывать.\n— Если хочешь пока остаться на базовом, я всё равно буду готов поддержать тебя при острой тревоге, но помни, что количество таких экстренных запросов ограничено, и мы не сможем глубоко копать.\n\nКак чувствуешь себя сейчас? Готов выбрать более глубокий формат или пока остаёшься в точечной поддержке? В любом случае, я здесь, чтобы помочь, когда тебе это потребуется."
      }
    ]
  }
}
